backend/app/controllers/api/v1/diaries_controller.rb

SELECT "diaries".* FROM "diaries" WHERE "diaries"."pet_id" = ? LIMIT ?  [["pet_id", 1], ["LIMIT", 1]]
---
    def index
        @diaries = Diary.find_by(pet_id: params[:pet_id])

SELECT "diaries".* FROM "diaries"
---
    def all_diaries
        @diaries = Diary.all

INSERT INTO "diaries" ("title", "post", "created_at", "updated_at", "pet_id") VALUES (?, ?, ?, ?, ?)  [["title", "Hello"], ["post", "Hello"], ["created_at", "2020-06-22 21:28:19.984588"], ["updated_at", "2020-06-22 21:28:19.984588"], ["pet_id", 1]]
---
    def create
        @diary = Diary.new(diary_params)
        if diary.save