backend/app/controllers/api/v1/pets_controller.rb

    def create
        @pet = Pet.new(pet_params)
        if @pet.save
---
INSERT INTO "pets" ("name", "birth_date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Yuki"], ["birth_date", "2014-12-01"], ["created_at", "2020-06-21 18:42:25.608849"], ["updated_at", "2020-06-21 18:42:25.608849"]]

    def update
        @pet = Pet.find(params[:id])
        if @pet.update(pet_params)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pets" SET "name" = ?, "birth_date" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["name", "Mickis"], ["birth_date", "2013-01-12"], ["updated_at", "2020-06-25 21:26:18.298848"], ["id", 1]]

    def destroy
        @pet = Pet.find(params[:id])

        if @pet.destroy
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 1]]